read_verilog fifo.v

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ../lib/cmos_cells.lib

abc -liberty ../lib/cmos_cells.lib

clean

write_verilog fifo_synth.v