read_verilog state_machine.v 

hierarchy -check -top state_machine

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ../lib/cmos_cells.lib

abc -liberty ../lib/cmos_cells.lib

clean

write_verilog state_machine_synth.v