read_verilog ./full_logic/full_logic.v 

hierarchy -check -top full_logic

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ./lib/cmos_cells.lib

abc -liberty ./lib/cmos_cells.lib

clean

write_verilog ./full_logic/full_logic_synth.v